
import React, { useState } from "react";
import PageBanner from "../../Components/pageBanner/PageBanner"
import FaqMan from "../../assets/image.png"
import { AnimatePresence, motion } from "framer-motion";
import { FaCaretDown, FaCaretUp } from "react-icons/fa";
import Reveal from "../../Components/Reveal/Reveal";
import Slider from "react-slick";


const FAQ = () => {
  const faqData = {
    about: [
      {
        question: "من هي شركة Pivot؟",
        answer: [
          { description: "نحن شركة سعودية مقرها الرئيسي الرياض، نشأتنا تمت عام 2019م ولدينا فريق عمل تمد خبراته إلى 7 سنوات بالسوق السعودي." }
        ]

      },
      {
        question: "ماهو الفرق بين Pivot وشركات التسويق الأخري؟",
        answer: [
          {
            title: "أولاً : الكيان السعودي",
            description: "نحن شركة سعودية مرخصة بالمملكة بسجل تجاري رقم ….. ومقرنا الرئيسي بالرياض "
          },

          { title: "ثانياً : خبرات فريق العمل ", description: "لدينا فريق عمل مميز تمت خبراته الى ٧ سنوات داخل السوق السعودي بالاضافة الى خبرات عامة بالتسويق تمتد الى ١٠ سنوات ." },

          { title: "ثالثا : سياسة عملنا ", description: "نحن لسنا مقدمين خدمة ،،، نحن شركاء بانجاح مشروع حيث اننا ندخل كل مشروع بتحدى جديد وشغف جديد لانجاحة والوصول الى الاهداف المرجوه." }
        ]
      },
      {
        question: "ما هي الخدمات التي تقدمها الشركة؟",
        answer: [
          { description: " بسبب ايماننا بالتخصص فقد قررنا التخصص بالتسويق الالكتروني للتميز وعليه: " },
          { title: "نحن شركة متخصصة في مجال التسويق الإلكتروني وخدماتنا هي: " },
          { details: "1- إدارة حسابات التواصل الاجتماعي " },
          { details: "2- إدارة الحملات الإعلانية المختلفة (قوقل / سوشيال ميديا) " },
          { details: "3- تهيئة وتحسين موقعك في محركات البحث " },
          { details: "4- إنشاء وتصميم موقع إلكتروني " },
          { details: "5- إنشاء وتصميم متجر إلكتروني " },
          { details: "5- إنشاد وتصميم تطبيقات جوال ", description: "بالإضافة إلى الخدمات الأخرى المتخصصة بالتسويق الإلكتروني في السعودية." },
        ],

      },
      {
        question: "كم عدد العاملين بالشركة وتخصصاتهم؟",
        answer: [
          { title: " لدينا مجموعة كبيرة من العاملين محلياً وعن بعد بالإضافة إلى الشركات التي قمنا بها مؤخراً مع شركات تقنية أخرى فقد بلغ عدد العاملين لدينا 22 موظف تختلف تخصصاتهم إلى: ", },
          { description: "1- محلل استراتيجي وخطتتي تسويقي. " },
          { description: "2- مدير مشروع. " },
          { description: "3- مدير تنفيذي للمهام." },
          { description: "4- مدير فريق عمل للمصميين الجرافك. " },
          { description: "5- مدير فريق عمل كتاب المحتوى بلغات مختلفة. " },
          { description: "6- مدير للمبرمجين ومصممين المواقع والتطبيقات. " },
          { description: "7- مدير فريق عمل SEO (تحسن موقعك بمحركات البحث)." },

        ]
      },
      {
        question: "لديكم فروع أخرى؟", answer: [
          { description: "مركزنا الرئيسي بالرياض وبحكم أن عملنا إلكتروني ومن ضمن قوى هذا المجال هو أننا نستطيع التواصل والتسويق لأي مجال حول العالم." }
        ]
      },
    ],
    services: [
      {
        question: "كيف يمكنني التقدم بخدمة؟",
        answer: [
          { description: " يسعدنا أن نقوم بخدمتك بكل سهولة يمكنك طلب خدماتنا من خلال نموذج الطلب (يتم عمل رابط اتصل بنا بالموقع) بصفحة اتصل بنا وسيقوم ممثلو خدمة العملاء التواصل معك مباشرة خلال ٢٤ ساعة. كما يمكنك التواصل المباشر مع اخصائي التسويق أستاذ محمود صلاح على الرقم التالي ******" }
        ]
      },
      {
        question: "هل هناك دعم فني /استشارات بعد تقديم الخدمة؟",
        answer: [
          { description: " أخي الكريم أنت بعد تعاقدك معنا أصبحت شريك لنا ونحن نسعد باتصالك دائما ومساعدتك في جميع احتياجاتك قدر الإمكان." }
        ]
      },
      {
        question: "هل تقومون بتطوير المواقع / حسابات التواصل / المتاجر الإلكترونية؟",
        answer: [
          { description: " نعم إذا أردت تطوير متجرك أو موقعك فنحن دائما بخدمك بل سنقوم بعرض عليك التقنيات الحديثة والاستشارات التي قد تفيد مجال عملك وتطورك للمرحلة القادمة." }
        ]
      },
      {
        question: "هل خدمات التسويق الإلكتروني ضرورية لشركتي أو متجري؟",
        answer: [
          { description: " في وقتنا الحالي، أصبح التسويق الإلكتروني ضرورة أساسية، إذ يحتل الأولوية مقارنة بالخدمات الأخرى، نتيجة التزايد الكبير في استخدام الإنترنت. ويعود ذلك لرغبة المستخدمين في تقليل التفاعل المباشر والابتعاد عن الأماكن العامة، مما يعزز من أهمية التسوق الإلكتروني كبديل آمن وسهل." }
        ]
      },
      {
        question: "كم يستغرق وقت العمل بعد التعاقد؟",
        answer: [
          { description: " سرعة العمل لدينا هي من أهم أولوياتنا لذلك نحن نحرص دائما على بدء العمل خلال ٢٤ ساعة بعد استيفاء كامل متطلبات فريق العمل" },
        ],

      },
    ],
    ideas: [
      {
        question: "هل تقومون بالاستثمار في الأفكار؟",
        answer: [
          { description: " نعم، نحن نسعد بالاستثمار في الأفكار، وخاصه الأفكار الجديد والفريدة كما أننا نقوم بدراسة الأفكار وتحليلها ومحاول الوصول إلى افضل الاستشارات المناسبة للفكرة المطروحة وتحديد الاستثمار الملائم للفكرة." }
        ]

      },
      {
        question: "هل تستثمرون في الشركات الناشئة وما هي المجالات التي تستثمرون فيها؟",
        answer: [
          { description: " نعم،  إذا كانت الشركة لديها رؤية واضحة ولديها فريق عمل تنفيذي للخدمة ومقدرتها في تلبية احتياجات العملاء، كما أننا نستثمر في جميع المجالات وخاصة إذا كان توجدنا راح يمثل إضافة قوية." }
        ]

      },
      {
        question: "هل تقومون بعمل شراكات تسويقية مع جهات شركات/ مؤسسات؟",
        answer: [
          { description: " نعم لدينا برنامج تربح نربح، هذا البرنامج يعمل على أن نكون شريك تسويقي ناجح للجهات (شركات /مؤسسات)، بالإضافة إلى الاستثمار في المشاريع الإلكترونية القائمة فعلياً كما أننا نسعد بأن نكون شريك استثمار لجهات ترغب في شريك تسويقي لنكون بإذن الله إضافة قوية لنمو الشركات ونجاحها." }
        ]

      },
      {
        question: "ما هي نطاق العمل الخاصة بكم في الاستثمار؟",
        answer: [
          { description: "1- التواصل مع خدمة العملاء." },
          { description: "2- الحصول على بيانات الشركة." },
          { description: "3- رفع الطلب للقسم المختص. " },
          { description: "4- مرحلة التدقيق ودراسة السوق." },
          { description: "5-  يتم التواصل معكم فريق عمل الاستثمار." },
          { description: "6- عمل اتفاقية مبدائية. " },
          { description: "7- عمل اتفاقيه نهائية. " },
          { description: "8- بداية العمل." },
        ]

      },
      {
        question: "كيفية تقديم لطلب الاستثمار؟",
        answer: [
          { description: " يمكن الطلب من خلال خدمة العملاء على الرقم التالي *****، وسيتم توصيلك إلى فريق عمل المستشارين الخاص بالاستثمار." }

        ],

      },
    ],
    privacy: [
      {
        question: "الخصوصية وبيان سريّة المعلومات",
        answer: [
          { description: "شركة Pivot تقدر مخاوفكم واهتمامكم بشأن خصوصية بياناتكم على شبكة الإنترنت. لقد تم إعداد هذه السياسة لمساعدتكم في تفهم طبيعة البيانات التي نقوم بتجميعها منكم عند زيارتكم لموقعنا على شبكة الانترنت وكيفية تعاملنا مع هذه البيانات الشخصية." },
        ],

      },
      {
        question: "التصفح",
        answer: [
          { description: "شركة Pivot للتسويق الإلكتروني لم تقم بتصميم هذا الموقع من أجل تجميع بياناتك الشخصية من جهاز الكمبيوتر الخاص بك أثناء تصفحك لهذا الموقع, وإنما سيتم فقط استخدام البيانات المقدمة من قبلك بمعرفتك ومحض إرادتك." },
        ],

      },
      {
        question: "عنوان بروتوكول شبكة الإنترنت (IP)",
        answer: [
          { description: "في أي وقت تزور فيه أي موقع انترنت بما فيها هذا الموقع، سيقوم السيرفر المضيف بتسجيل عنوان بروتوكول شبكة الإنترنت (IP) الخاص بك، تاريخ ووقت الزيارة ونوع متصفح الإنترنت الذي تستخدمه والعنوان URL الخاص بأي موقع من مواقع الإنترنت التي تقوم بإحالتك إلى الى هذا الموقع على الشبكة." },
        ],
      },
      {
        question: "عمليات المسح على الشبكة",
        answer: [
          { description: "إن عمليات المسح التي تقوم بها شركة Pivot للتسويق الإلكتروني مباشرة على الشبكة تمكننا من تجميع بيانات محددة مثل البيانات المطلوبة منك بخصوص نظرتك وشعورك تجاه موقعنا.تعتبر ردودك ذات أهمية قصوى , ومحل تقديرنا حيث أنها تمكننا من تحسين مستوى موقعنا, ولك كامل الحرية والإختيار في تقديم البيانات المتعلقة بإسمك والبيانات الأخرى." },
        ],
      },
      {
        question: "الروابط بالمواقع الأخرى على شبكة الإنترنت",
        answer: [
          { description: " قد يشتمل موقعنا على روابط بالمواقع الأخرى على شبكة الإنترنت. او علانات من مواقع اخرى مثل Google AdSense ولا نعتبر مسئولين عن أساليب تجميع البيانات من قبل تلك المواقع, يمكنك الاطلاع على سياسات السرية والمحتويات الخاصة بتلك المواقع التي يتم الدخول إليها من خلال أي رابط ضمن هذا الموقع.  شركة Pivot للتسويق الإلكتروني قد تستعين بشركات إعلان لأطراف ثالثة لعرض الإعلانات عندما تزور موقعنا على الويب. يحق لهذه الشركات أن تستخدم معلومات حول زياراتك لهذا الموقع ولمواقع الويب الأخرى (باستثناء الاسم أو العنوان أو عنوان البريد الإلكتروني أو رقم الهاتف)، وذلك من أجل تقديم إعلانات حول البضائع والخدمات التي تهمك. إذا كنت ترغب في مزيد من المعلومات حول هذا الأمر وكذلك إذا كنت تريد معرفة الاختيارات المتاحة لك لمنع استخدام هذه المعلومات من قِبل هذه الشركات، فالرجاء التواصل معنا." },
        ],
      },
      {
        question: "خصوصية البيانات الشخصية",
        answer: [
          { description: " ستحافظ شركة Pivot للتسويق الإلكتروني في كافة الأوقات على خصوصية وسرية كافة البيانات الشخصية التي نتحصل عليها. ولن يتم إفشاء هذه المعلومات إلا إذا كان ذلك مطلوباً بموجب أي قانون أو عندما نعتقد بحسن نية أن مثل هذا الإجراء سيكون مطلوباً أو مرغوباً فيه للتمشي مع القانون , أو للدفاع عن أو حماية حقوق الملكية الخاصة بهذا الموقع أو الجهات المستفيدة منه. البيانات اللازمة لتنفيذ المعاملات المطلوبة من قبلك عندما نحتاج إلى أية بيانات خاصة بك , فإننا سنطلب منك تقديمها بمحض إرادتك. حيث ستساعدنا هذه المعلومات في الاتصال بك وتنفيذ طلباتك حيثما كان ذلك ممكنناً. لن يتم اطلاقاً بيع البيانات المقدمة من قبلك إلى أي طرف ثالث بغرض تسويقها لمصلحته الخاصة دون الحصول على موافقتك المسبقة والمكتوبة ما لم يتم ذلك على أساس أنها ضمن بيانات جماعية تستخدم للأغراض الإحصائية والأبحاث دون اشتمالها على أية بيانات من الممكن استخدامها للتعريف بك." }
        ],
      },
      {
        question: "عند الاتصال بنا",
        answer: [
          { description: "سيتم التعامل مع كافة البيانات المقدمة من قبلك على أساس أنها سرية . تتطلب النماذج التي يتم تقديمها مباشرة على الشبكة تقديم البيانات التي ستساعدنا في تحسين موقعنا.سيتم استخدام البيانات التي يتم تقديمها من قبلك في الرد على كافة استفساراتك , ملاحظاتك , أو طلباتك من قبل هذا الموقع أو أيا من المواقع التابعة له." }
        ],

      },
      {
        question: "مشاركة المعلومات لأي طرف ثالث",
        answer: [
          { description: "شركة Pivot للتسويق الإلكتروني لن تقوم ببيع أو المتاجرة أو تأجير أو إفشاء أي معلومات لمصلحة أي طرف ثالث خارج هذا الموقع، أو المواقع التابعة له. وسيتم الكشف عن المعلومات فقط في حالة صدور أمر بذلك من قبل أي سلطة قضائية أو تنظيمية." },
        ],
      },
      {
        question: "التعديلات على سياسة سرية وخصوصية المعلومات",
        answer: [
          { description: "تحتفظ Pivot للتسويق الإلكتروني بالحق في تعديل بنود وشروط سياسة سرية وخصوصية المعلومات إن لزم الأمر ومتى كان ذلك ملائماً. سيتم تنفيذ التعديلات هنا أو على صفحة سياسة الخصوصية الرئيسية وسيتم بصفة مستمرة إخطارك بالبيانات التي حصلنا عليها، وكيف سنستخدمها والجهة التي سنقوم بتزويدها بهذه البيانات." },
        ],

      },
      {
        question: "الاتصال بنا",
        answer: [
          { description: "يمكنكم الإتصال بشركة pivot للتسويق الإلكتروني عند الحاجة من خلال الضغط على رابط اتصل بنا المتوفر في روابط موقعنا أو الإرسال إلى بريدنا الإلكتروني info على اسم النطاق أعلاه. يمكنكم أيضاً متابعة أهم الأسئلة وإجاباتها عن التسويق الإلكتروني وماتقدمه Pivot من خلال صفحة أسئلة متكررة عن التسويق الإلكتروني." }
        ],
      }
    ],
    marketing: [
      {
        question: "ما هي طرق التسويق الحديث؟",
        answer: [
          { description: " من المعلوم أن التطور التكنولوجي الذي شاهده العصر أدى إلى ظهور الكثير من طرق التسويق الحديثة؛ حيث قامت بعض الشركات بتطبيق هذه الطرق في بيع منتجاتها مما أدى إلى نجاحها في السوق. وفيما يلي سنقدم لك أبرز هذه الطرق: " },
          { title: "1- صفحات الويب ", description: "وهي الصفحات الإلكترونية الموجودة على شبكة الإنترنت؛ حيث أنها تشتمل على وصف الخدمة المراد بيعها. بالإضافة إلى أنها تحتوي على عبارات تساعد في تطبيق الإجراءات المناسبة للشراء مثل الخيار المشهور  ( اشتري الآن ) " },
          { title: "2- البريد الإلكتروني", description: "يعد البريد الإلكتروني طريقة من أشهر طرق التسويق المميزة؛ حيث أنه يلعب دوراً كبيراً في تقديم عروض تسويق المبيعات للأفراد خاصةً إذا كانت هناك قائمة تحتوي على أسماء العملاء الذين قاموا بتقديم عناوينهم البريدية الإلكترونية للشركة. يساعد البريد الإلكتروني العديد من الشركات في إرسال رسائل تسويقية تسويقية كل شهر تشتمل على المنتجات التي ترغب ببيعها خلال الشهر، وقد ثبت أن هذه الطريقة ذات تأثير فعال في استجابة العملاء؛ لِتفاعلهم مع المنتجات التي ترسلها الشركة. " },
          { title: "3- الإعلان باستخدام وسائل التواصل الاجتماعي", description: "تعتبر هذه الطريقة أيضاً واحدة من أفضل طرق التسويق الحديثة؛ حيث أنها تساعد أصحاب الشركات على اختيار أنسب أدوات التواصل الاجتماعي للعملاء لعرض منتجاتهم." },
        ],
      },
      {
        question: "ما هو التسويق الرقمي؟",
        answer: [
          { description: " يُعرف التسويق الرقمي على أنه تطبيق المبادئ العامة في علم التسويق وذلك عن طريق استخدام أدوات التكنولوجيا الحديثة التي تتلخص في الإنترنت. كما يُعرف أيضاً على أنه الاستراتيجيات المستخدمة في تحويل الأسواق الرقمية الافتراضية إلى أسواق واقعية ملموسة. " },
          { title: "هذا، ويساعد التسويق الرقمي في الوصول إلى العميل وذلك عن طريق الطرق العصرية الحديثة مثل: ", description: "1- البريد الإلكتروني. " },
          { description: "2- والرسائل النصية. " },
          { description: "3- وتطبيقات الهواتف المحمولة. " },
          { description: "4- والرسائل الفورية. " },
          { description: "5- ولوحات الإعلانات الإلكترونية. " },
          { description: "6- ومواقع التواصل الاجتماعي." },
          { description: "7- ومحركات البحث. " },
          { description: "وتجدر بنا الإشارة إلى أن التسويق الرقمي لا يشير إلى تكنولوجيا الاتصالات الحديثة فقط، ولكنه يشير أيضاً إلى الأجهزة التكنولوجية مثل الهواتف الذكية، والتلفزيونات المتصلة بالإنترنت." },
        ],

      },
      {
        question: "ما هي مزايا التسويق الرقمي؟",
        answer: [
          { description: "يقدم التسويق الرقمي لِمستخدميهِ مجموعة من المزايا والتي تساعد في تحقيق زيادة كبيرة في الربح، وفيما يلي سنقدم لك مزايا التسويق الرقمي: " },
          {
            title: "1- وجود إمكانية التفاعل بين العميل والبيزنس ",
            description: "يتيح التسويق الرقمي إمكانية التفاعل بشكل مباشر بين العملاء، كما أنه يمكنهم من التعبير عن آرائهم ورغباتهم للشركة أو النشاط التجاري مباشرةً. "
          },
          {
            title: "2- يساعد في الاستهداف ",
            description: "كذلك، من مزايا التسويق الرقمي أنه يمكن المؤسسات من القيام بالاستهداف؛ حيث يقوم بجمع المعلومات الدقيقة عن العملاء المحتملين الذين يمكن تحقيق نسبة كبيرة من المبيعات عن طريقهم. هذا، وتجدر بنا الإشارة إلى أن التسويق الرقمي يقوم بالاستهداف وفقاً لعدة معايير منها: ",
            details: "1- العمر.",
          },
          { details: "2- النوع سواء ذكر أو أنثى" },
          { details: "3- الكلمات البحثية. " },
          { details: "4- كما يقوم بالاستهداف وفقاً للزيارات الأخيرة للمواقع." },
          { details: "5- والمؤهل الدراسي. " },
          { details: "6- بالإضافة إلى الموقع الجغرافي الذي يتواجد به الشخص. " },
          { title: "3- القدرة على جمع البيانات", description: "أيضاً من مميزات التسويق الرقمي أنه يمكن أصحاب الشركات من جمع بيانات العملاء، وإعادة استخدامها؛ حتى يمكن تقديم عروض تسويقية مميزة، أو الحصول على زيادة كبيرة من المبيعات لنفس العملاء الذين قاموا بعملية الشراء من قبل. " },
          { title: "4- القدرة على قياس النتائج ", description: "يلعب التسويق الرقمي دوراً كبيراً في تسجيل، وتحليل النتائج التسويقية المطلوبة بشكل دقيق؛ حتى يمكن عمل التحسينات، ومن ثم يمكن اتخاذ القرارات المناسبة والتي تساهم في تطوير البيزنس وتعمل على تطويره. " },
          { title: "5- سرعة الحصول على نتائج مقارنةً بالتسويق التقليدي ", description: "سرعة الحصول على نتائج مقارنةً بالتسويق التقليدي يقوم التسويق الرقمي بحصد النتائج بشكل سريع؛ حيث يمكن من خلاله توجيه عملية التسويق بشكل دقيق في الاتجاه الذي يرغب به صاحب البيزنس، كما يمكن من خلاله قياس كل شيء، والاطلاع على النتائج أولاً بأول." },
        ],

      },
      {
        question: "ما هو دور التسويق لِجذب العملاء؟",
        answer: [
          {
            description: "العميل يختار خدمة معينة ويفضلها على أخرى بسبب تسويق الخدمة لنفسها فالتسويق يعمل على إبراز المميزات الخاصة بالخدمة أو المنتج وتوضيح كافة التفاصيل للعملاء بطرق جذابة، وهناك طرق كثيرة للتسويق الإلكتروني والتي منها: ",
            title: "1- التسويق عبر منصات التواصل الاجتماعي ", details: "والتي فيها يتم استخدام منصات السوشيال ميديا للترويج والتسويق للمنتج والخدمة بصورة واسعة واستهداف للعملاء بطريقة صحيحة. "
          },
          { title: "2- التسويق عبر محركات البحث ", details: "وفيها يتم العمل على تحسين المحتوى لمحركات البحث كي يظهر المحتوى في محركات البحث ويزيد ذلك من نسبة زيارة العملاء للموقع الخاص بك. لذا، فإن للتسويق أهمية كبيرة في جذب العملاء وزيادة معدلات بيع المنتجات أو الخدمات." },
        ],
      },
      {
        question: "ما هي أهم أدوار التسويق الرقمي؟",
        answer: [
          { title: "1- التسويق والإعلان ", details: "يعد التسويق والإعلان من أبرز أدوار التسويق التي تقوم بجذب العملاء بشكل مطلق خاصةً إذا كانت الشركة تمتلك الميزانية، ولا تتوفر هناك أي وسيلة أفضل للوصول إلى أجزاء أكبر من المجتمع. " },
          { title: "2- التواصل ", details: "يلعب التواصل المباشر مع العميل دوراً كبيراً في تحقيق نسب أعلى من المبيعات، كما يمكن عن طريقه تحقيق سمعة جيدة للشركة خاصةً إذا عمل فريق الشركة بشكل محترف مع العملاء." }

        ],
      },
      {
        question: "ما هي الاستفادة من ظهور موقعيِ في الصفحة الأولى بمحركات البحث؟",
        answer: [
          { description: "يبحث الكثير من الأشخاص عن إجابة للأسئلة التي تجول في خَاطرهم حول محركات البحث في العديد من المواقع أملاً في الحصول على أفضل إجابة، وفيما يلي سنعرض لك أفضل إجابة لهذا السؤال: " },
          {
            title: "1- جذب الجمهور المستهدف ",
            details: "إن ظهور موقعك في الصفحة الأولى بمحركات البحث يساهم بشكل كبير في جذب جمهورك المستهدف خاصةً أثناء إذا كان يبحث عن أي شيء متعلق بالمنتج الذي تبيعه؛ حيث يستخدم العديد من العملاء محركات البحث في البحث عن المعلومات حول أي منتج يرغبون بشرائه وهذه من أفضل الفرص المميزة لِتحقيق الأهداف التسويقية."
          },
          {
            title: "2- البقاء في الصدارة ",
            details: "إن ظهور موقعك في الصفحة الأولى بمحركات البحث يجعل موقعك في الصدارة في صفحة نتائج البحث، وبذلك تحصل على أعلى الزيارات بشكل مباشر، ومن ثم يتم تحويل الزوار إلى عملاء حقيقين لك. "
          },
          { title: "3- زيادة مبيعاتك والوصول إلى أهدافك ", details: "كذلك، يمكنك أيضاً الاستفادة من ظهور موقعك في الصفحة الأولى بمحركات البحث لزيادة نسبة مبيعاتك؛ حيث يوجد خوارزميات بحث تركز على تقديم نتائج بحث طبيعية دون دفع أي مبلغ مالي مقابل أن يتصدر موقعك نتائج البحث الأولى، وهذا يلعب دوراً كبيراً في تحقيق مبيعات أعلى." },
        ],
      },
      {
        question: "كيفية الاستفادة من التسويق الإلكتروني",
        answer: [
          { description: "يمكنك الاستفادة من التسويق الإلكتروني من خلال عدة جوانب مثل: " },
          { title: "1- التواجد أون لاين يضمن لك تحقيق نجاح أكبر ", details: "عليك أن تعلم أن تواجدك أون لاين يمنحك الفرصة لتعرف المزيد من الجمهور على علامتك التجارية بشكل أكبر، مما يسهل على الزبائن الوصول إليك والحصول على منتجاتك بسرعة. " },
          { title: "2- تحديد الجمهور المستهدف ", details: "أيضاً، يمكنك الاستفادة من التسويق الإلكتروني بِتحديد الجمهور الذي يحتاج إلى منتجاتك؛ حتى تجذب انتباههم باستمرار، وتتأكد من أنك تلبي احتياجاتهم على الوجه المطلوب، ومن ثم تزيد معدلات أرباحك. " },
          { title: "3- عمل خطط واستراتيجيات ", details: "كذلك، يفيد التسويق الإلكتروني في عمل خطط واستراتيجيات، وهذا يلعب دوراً كبيراً في التأكد من أن جميع خطط المشروع مدروسة بشكل كامل، ومجدية من الناحية الإقتصادية، وتسير نحو الاتجاه الصحيح. بالإضافة إلى ذلك، فإنك تستفيد من الأخطاء التي قد تقع خلال مراحل المشروع، وتتخذ قرارت بناءً عليها. " },
          { title: "4- دراسة المنافسين ", details: "أيضاً من الفوائد التي تعود عليك من التسويق الإلكتروني، هو إمكانية التعرف على المنافسين، وجمع معلومات عنهم من ناحية الأسعار والخدمات التي يقدمونها، وبالتالي تستعد لإيجاد أكثر من مجال للمنافسة، ومن ثم تجد أكثر من طريق للوصول إلى الفئة المستهدفة." },
        ],
      },
      {
        question: "ما هي طرق جذب العميل عبر الإنترنت؟",
        answer: [
          { description: "يلعب التسويق الإلكتروني دوراً كبيراً في إقناع العميل بشراء المنتج المُقدم عبر وسائل التواصل الإجتماعي دون أن تحدث مقابلة شخصية، وفيما يلي سنقدم لك أفضل طرق جذب العميل على الإنترنت." },
          { title: "1- المحتوى المرئي ", details: "يعد المحتوى المرئي وسيلة من أفضل وسائل جذب العميل على الإنترنت، وذلك يكون عن طريق الفيديوهات، والعروض التقديمية التي توضح منتجاتك للعملاء. " },
          { title: "2- نشاط رسمي ", details: "يعد توفر نشاط رسمي خاص بك على الإنترنت طريق من أفضل طرق جذب العميل، وهو أن يكون لديك سجل تجاري، وبطاقة ضريبية، وعلى الرغم من أن هذا الأمر ليس ضرورياً إلا أنه يلعب دوراً كبيراً في في زيادة الثقة عند العميل تجاهك، ويجعله يشعر بالطمأنينة. " },
          { title: "3- شرح فوائد المنتج ", details: "عندما يتعرف العميل على كل ما يتعلق بالمنتج والخدمات التي تقدمها فإن ذلك يجذبه لعملية الشراء؛ لذلك عليك بشرح وتبسيط الأمور في الحملات الإعلانية عبر الإنترنت، وتقديم كل ما يجذب العميل اليك؛ حتى لا يشعر بالملل. " },
          { title: "4- إنشاء موقع تعريفي ", details: "من طرق جذب العميل عبر الإنترنت أيضاً، أن تقوم بجمع كل المعلومات الخاصة بنشاطك التجاري في موقع خاص بك؛ حتى تُسهل على العميل الاطلاع على جميع التفاصيل التي تتعلق بنشاطك التجاري." },
        ],
      },
      {
        question: "طرق أخرى لِجذب العميل لِنشاطك التجاري عبر الإنترنت",
        answer: [
          { title: "من أشهر طرق جذب العميل للنشاط التجاري :" },
          { description: "1- القيام بِحملات إعلانية ممولة على الفيس بوك، وتويتر، وانستقرام. " },
          { description: "2- إنشاء حملات إعلانية في محركات البحث مثل محرك بحث جوجل. " },
          { description: "3-  إرسال رسائل ترويجية عن طريق البريد الإلكتروني للعملاء. " },
          { description: " 4- كذلك من طرق جذب العملاء للنشاط التجاري التسويق بالمحتوى في محركات البحث." },
        ],
      },
    ],
  };
  const [activeSection, setActiveSection] = useState("about");
  const [openQuestionIndex, setOpenQuestionIndex] = useState(null);
  const toggleQuestion = (index) => {
    setOpenQuestionIndex(openQuestionIndex === index ? null : index);
  };

  var settings = {
    arrow: false,
    infinite: true,
    slidesToShow: 5,
    swipeToSlide: true,
    // rtl: true,
    responsive: [{
      breakpoint: 600,
      settings: {
        slidesToShow: 2,
        // infinite: false,
        // arrows: false,
        swipeToSlide: true,
        // rtl: true,
      }
    }]

  };
  return (
    <div className="">
      <PageBanner head={'الأسئلة الشائعه'} />
      <div className="md:px-48 py-10">
        <div className="p-4 ">
          <Reveal>
            <div className="heading text-center">
              <h2 className="text-theme font-bold text-2xl">أسئلة شائعة</h2>
              <p className="font-bold text-xl py-2">دائما نسعى إلى إجابة جميع الأسئلة التي تدور ببالك وإذا في أي استفسار نسعد بتواصلك معنا.</p>
            </div>
          </Reveal>
          <div className="mt-10">
            <Reveal>
              <nav className=" p-4 ">
                <Slider className='' {...settings}>
                  <div className="px-5">
                    <button
                      onClick={() => { setActiveSection("about"); setOpenQuestionIndex(null); }}
                      className={`px-3 sm:px-4 py-2 w-full rounded-full transition ${activeSection === "about" ? "bg-gradient-to-r from-blue-400 to-indigo-500 text-white" : "bg-gray-200 hover:bg-gray-300 "
                        }`}
                    >
                      عن الشركة
                    </button>
                  </div>
                  <div className="px-5"><button
                    onClick={() => { setActiveSection("services"); setOpenQuestionIndex(null); }}
                    className={`px-3 sm:px-4 py-2 w-full rounded-full transition ${activeSection === "services" ? "bg-gradient-to-r from-blue-400 to-indigo-500 text-white" : "bg-gray-200 hover:bg-gray-300 "
                      }`}
                  >
                    عن الخدمات
                  </button></div>
                  <div className="px-5"><button
                    onClick={() => { setActiveSection("ideas"); setOpenQuestionIndex(null); }}
                    className={`px-3 sm:px-4 py-2 w-full rounded-full transition ${activeSection === "ideas" ? "bg-gradient-to-r from-blue-400 to-indigo-500 text-white" : "bg-gray-200 hover:bg-gray-300 "
                      }`}
                  >
                    الاستثمار في الأفكار
                  </button></div>
                  <div className="px-5"><button
                    onClick={() => { setActiveSection("privacy"); setOpenQuestionIndex(null); }}
                    className={`px-3 sm:px-4 py-2 w-full rounded-full transition ${activeSection === "privacy" ? "bg-gradient-to-r from-blue-400 to-indigo-500 text-white" : "bg-gray-200 hover:bg-gray-300 "
                      }`}
                  >
                    سياسة الخصوصية
                  </button></div>
                  <div className="px-5"><button
                    onClick={() => { setActiveSection("marketing"); setOpenQuestionIndex(null); }}
                    className={`px-3 sm:px-4 py-2  w-full rounded-full transition ${activeSection === "marketing" ? "bg-gradient-to-r from-blue-400 to-indigo-500 text-white" : "bg-gray-200 hover:bg-gray-300 "
                      }`}
                  >
                    التسويق الإلكتروني
                  </button></div>

                </Slider>
                <div className="flex justify-center gap-x-2 sm:gap-x-4">

                </div>
              </nav>
            </Reveal>

            <div className="container mx-auto mt-3 md:pt-10 px-2 sm:px-4 ">
              <Reveal>
                <div className="flex flex-col md:flex-row items-center justify-between">
                  <div className="w-full md:w-1/2 lg:w-full space-y-5 mt-10 ">
                    {faqData[activeSection].map((faq, index) => (
                      <div key={index} className=" xl:justify-center items-center">
                        <button
                          className="w-full text-right p-4 bg-gradient-to-r from-blue-400 to-indigo-500 text-white flex justify-between items-center rounded-2xl focus:outline-none"
                          onClick={() => toggleQuestion(index)}
                        >

                          <span>{faq.question}</span>
                          <span>
                            {openQuestionIndex === index ? (
                              <FaCaretUp />
                            ) : (
                              <FaCaretDown />
                            )}
                          </span>
                        </button>
                        <AnimatePresence>
                          {openQuestionIndex === index && (

                            <motion.div
                              initial={{ height: 0, opacity: 0 }}
                              animate={{ height: "auto", opacity: 1 }}
                              exit={{ height: 0, opacity: 0 }}
                              transition={{ height: { duration: 0.4 }, opacity: { duration: 0.3 } }}
                              className="overflow-hidden bg-white"
                            >
                              <div className="p-4">
                                {faq.answer.map((point, i) => (
                                  <div key={i} className="mb-4">
                                    <h4 className="font-bold text-indigo-600">{point.title}</h4>
                                    <p className="text-black">{point.description}</p>
                                    <p className="text-black">{point.details}</p>
                                  </div>
                                ))}
                              </div>
                            </motion.div>

                          )}
                        </AnimatePresence>
                      </div>
                    ))}
                  </div>
                  <div className="">
                    <img
                      src={FaqMan}
                      alt=""
                      className="w-full hidden xl:block "
                    />
                  </div>
                </div>
              </Reveal>
            </div>
          </div>
        </div>
      </div>
    </div>
  );
};
export default FAQ;